Revit 2026 API

# FormulaEditingEventArgs Class

---

The event arguments used by the DocumentSaving event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPIPreEventArgs Autodesk.Revit.UI.EventsFormulaEditingEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FormulaEditingEventArgs : RevitAPIPreEventArgs
```
```vb
Public Class FormulaEditingEventArgs
	Inherits RevitAPIPreEventArgs
```
```cpp
public ref class FormulaEditingEventArgs : public RevitAPIPreEventArgs
```
```fsharp
type FormulaEditingEventArgs =
    class
        inherit RevitAPIPreEventArgs
    end
```

The FormulaEditingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | CurrentDocument | Returns the current document |
|  | Formula | Returns text of the formula that will be modified |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | ParameterId | Returns the Id of the modified parameter |

|  | Name | Description |
| --- | --- | --- |
|  | Apply | Applies formula to the parameter |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace